Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4CMP32C_1.xml
        <register caption="Interrupt Enable Command Register" name="IPC_IECR" offset="0x000C" rw="W" size="4">
          <bitfield caption="Interrupt Enable" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Enable" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Enable" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Enable" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Enable" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Enable" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Enable" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Enable" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Enable" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Enable" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Enable" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Enable" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Enable" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Enable" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Enable" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Enable" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Enable" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Enable" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Enable" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Enable" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Enable" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Enable" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Enable" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Enable" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Enable" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Enable" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Enable" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Enable" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Enable" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Enable" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Enable" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Enable" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Disable Command Register" name="IPC_IDCR" offset="0x0010" rw="W" size="4">
          <bitfield caption="Interrupt Disable" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Disable" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Disable" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Disable" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Disable" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Disable" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Disable" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Disable" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Disable" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Disable" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Disable" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Disable" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Disable" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Disable" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Disable" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Disable" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Disable" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Disable" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Disable" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Disable" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Disable" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Disable" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Disable" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Disable" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Disable" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Disable" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Disable" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Disable" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Disable" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Disable" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Disable" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Disable" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Mask Register" name="IPC_IMR" offset="0x0014" rw="R" size="4">
          <bitfield caption="Interrupt Mask" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Mask" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Mask" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Mask" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Mask" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Mask" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Mask" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Mask" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Mask" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Mask" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Mask" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Mask" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Mask" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Mask" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Mask" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Mask" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Mask" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Mask" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Mask" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Mask" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Mask" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Mask" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Mask" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Mask" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Mask" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Mask" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Mask" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Mask" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Mask" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Mask" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Mask" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Mask" mask="0x80000000" name="IRQ31"/>
        </register>
